// index.ts
// 获取应用实例
const app = getApp<IAppOption>()
const defaultAvatarUrl = 'https://mmbiz.qpic.cn/mmbiz/icTdbqWNOwNRna42FI242Lcia07jQodd2FJGIYQfG0LAJGFxM4FbnQP6yfMxBgJ0F3YRqJCJ1aPAK2dQagdusBZg/0'

Component({
  data: {
    list: [
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
      {花纹: 'XG02', 新技术: 'XXXX', 寸别: 15, 规格: '195/65SR', 级别: 915, '国产/进口': '国产'},
    
    ],
    header: [
      {label: '花纹',prop: '花纹',  width: 100 },
      {label: '新技术',prop: '新技术',  width: 150 },
      {label: '寸别',prop: '寸别',  width: 100 },
      {label: '规格',prop: '规格',  width: 140 },
      {label: '级别',prop: '级别',  width: 100 },
      {label: '国产/进口', prop: '国产/进口', width: 150}
    ]
  },
  methods: {
    
  },
})
